app/controllers/application_controller.rb

INSERT INTO "boards" ("updated_at", "turn", "created_at", "state") VALUES ('2011-01-30 21:56:44.041075', NULL, '2011-01-30 21:56:44.041075', '---
---
    def start_game
      @human_is_going_first = params[:human_is_first]
      @board = Board.new
      @board.init
      @board.save