app/controllers/board_controller.rb

INSERT INTO "boards" ("updated_at", "turn", "created_at", "state") VALUES ('2011-02-01 07:15:40.054809', NULL, '2011-02-01 07:15:40.054809', '---
---
    def start_game
        @human_is_going_first = params[:human_is_first]
        @board = Board.new
        @board.init
        @board.save

SELECT "boards".* FROM "boards" WHERE ("boards"."id" = 2) LIMIT 1
---
    def take_turn
        #assume that this is only against an A.I. and that if this method
        # is invoked, it is because a human told it to.
        @board = Board.find(params[:id])

UPDATE "boards" SET "state" = '---
---
            return
            end

            @board.save